//! 1-50
// let i;
// for (let i = 0; i <= 50; i++) {
//   console.log(i);
// }
//!50-1
// for(let i1=50; i1>= 1; i1--){
//     console.log(i1);
// }
//! 1-50-четный

// for(let i = 0; i<=50; i++){
//     if(i%2===0){
//         console.log(i);
//     }
// }
//! 1-50- не четный

// for (let i = 0; i <= 50; i++) {
//   if (i% 2!==0){
//   }
//   console.log(i);
// }

//! 1-50 10 чон 40 кичине сандар

//! let arr=["x","x","x","x","x","x","x","x","x","x"]

// let arr=[]
// for(let i = 1; i<=10;++i){
//   arr.push('x')
// }
// console.log(arr);

//! Задание №1
// Дан массив ["Sultan", "Azamat", "Eldar", "Islam", "Taalai"].
// Выведите в консоль имена Azamat и Islam с помощью цикла for

// let arr = ["Sultan", "Azamat", "Eldar", "Islam", "Taalai"];
// let res = [];
// for (let i in arr) {
//   if (i % 2 !== 0) {
//     res.push(arr[i]);
//   }
// }
// console.log(res);

//! Задание №2
// Создайте пустой массив и заполните его числами от 1 до 10 с
// помощью цикла for

// let arr = [];
// for (let i = 1; i <= 10; i++) {
//   arr.push(i)
// }
// console.log(arr);

//! Задание №3
// Выведите в консоль все числа в промежутке с 50 до 99 включительно
// с помощью цикла.

// for(let i=50; i<=99;i++){
//   console.log(i);
// }

//! Задание №4
// Выведите те же числа, но уже в обратном порядке, т.е. с 99 до 50.

// for(let i=99;i>=50;i--){
//   console.log(i);
// }

//! Задание №5
// Найдите самый длинный элемент массива и вывкдите в консоль
// ["pen", "pineapple", "apple", "pen"]

let arr = ["pen", "pineapple", "apple", "pen"];
let res = []
for (let i of arr) {
  console.log(i);
}

//! Задание №6
// Так же найдите самый короткий элемент этого же массива

//! Задание №7
// Выведите в консоль все элементы с четными индексами.
// [1,2,3,4,5,6,7,8,9]

// let arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];
// for (let i of arr) {
//   if (i % 2 === 0) {
//     console.log(i);
//   }
// }

//! Задание №8
// Дан двумерный массив. Выведите в консоль все элементы.
// [[1,2], [3,4], [5,6]]

// let arr = [
//   [1, 2],
//   [3, 4],
//   [5, 6],
// ];
// for (let i of arr) {
//   for (let j of i) {
//     console.log(j);
//   }
// }
