// Создайте функцию rgb(), которая будет принимать три числовых аргумента
// и возвращать строку вида «rgb(23,100,134)».
// Если аргументы не заданы, считать их равными нулю.

// let result = "";
// function checkTask(a, b, c) {

// }
// console.log(checkTask("23,100,134"));

// Напишите функцию, где пользователь вводит любое целое положительное число.
// А программа суммирует все числа от 1 до введенного пользователем числа.

// Напишите функцию, которая принимает на вход массив чисел и
// возвращает сумму всех элементов массива.

// Создайте функцию, которая принимает массив строк и возвращает новый массив,
// содержащий только те строки, которые начинаются с заглавной буквы.

// Напишите функцию, которая принимает массив чисел и возвращает новый массив,
// содержащий только четные числа.

// Напишите функцию, которая принимает массив чисел и возвращает наименьшее
// и наибольшее число в массиве в виде массива из двух элементов.

// Создайте функцию, которая принимает массив чисел и возвращает
// новый массив, содержащий элементы исходного массива в обратном порядке.

// Напишите функцию, которая принимает массив чисел и возвращает среднее
// арифметическое всех элементов массива.

// Реализуйте функцию, которая принимает массив строк и возвращает новый
// массив, в котором каждая строка записана в верхнем регистре.

// Напишите функцию, которая принимает массив чисел и возвращает новый
// массив, в котором каждый элемент умножен на 2.

// Создайте функцию, которая принимает массив строк и возвращает новый массив,
// содержащий только те строки, которые содержат более 5 символов.

// Задание №1
// Создайте функцию checkTask которая выводит в консоль строку:
// Hello World!

// Задание №2
// Напишите функцию checkTask(), которая при вызове будет возвращать строку:
// Привет, JavaScript!

// Задание №3
// Создайте функцию checkTask(), которая принимает в качестве
// аргумента два числа и возвращает их сумму.
// Например, для чисел 2 и 20 функция возвратит: 22

// Задание №4
// Напишите функцию checkTask(), которая в качестве аргумента принимает
// число - возраст.
// Если возраст больше или равен 18 возвратите строку:
// Добро пожаловать
// иначе:
// Вход запрещен

// Задание №5
// Напишите функцию checkTask(), которая принимает целое число и
// возвращает сумму всех его цифр.
// Например, для числа , функция должна вернуть:
// 15
// так как 4 + 5 + 6 = 15

// Задание №6
// Напишите функцию checkTask(), которая принимает два аргумента,
// строку и букву.
// Функция должна возвращать число повторений переданной буквы в строке.
// Например, если были переданы такие аргументы - , функция должна
// возвратить: 2
// т.к в строке 'hello' две буквы 'l'

// Задание №7
// Напишите функцию, которая принимает параметром элемент и
// возвращает его тип (typeof)


// Напишите функцию которая принимает массив из чисел.
// Находит количество четных чисел в массиве и их сумму.
// И выведите их на экран.
// К примеру:
// let arr = [1, 2, 3, 4, 5, 6]
// Четные числа в массиве: ${newArr} их сумма равна ${sum}
// Четные числа в массиве: [2, 4, 6] их сумма равна 12

// Задание № 8
// Напишите функцию, которая принимает массив с числами и выводит
// количество отрицательных чисел в этом массиве
// Пример: [7, -5, -29, 0, 62, 4, 5, -6, -27]
// Вывод: //4

// Задание № 9
// Напишите функцию checkTask которая принимает число и возвращает
// его факториал.
// Факториал числа - это умножение всех порядковых чисел от 1
// до самого числа.
// Например для числа , функция должна возвратить:
// 120
// т.к
// для числа , результатом будет:
// 720
